#Συνάρτηση που δέχεται μια συμβολοσειρά(s) και ένα χαρακτήρα(letter)
#και επιστρέφει μία λίστα με όλες τις θέσεις του χαρακτήρα στην συμβολοσειρά.
#Την χρησιμοποιώ στην περίπτωση που μαντευτεί ένα σωστό γράμμα,  για να αντικατασταθούν οι παύλες
#με αυτό το γράμμα σε όλες τις θέσεις που του αντιστοιχούν στην κρυφή λέξη.
def findLetters(s,letter):
    t = 0  #δείκτης της θέσης του στοιχείου
    L = []
    while t < len(s) and s[t:].find(letter) != -1:
        t += s[t:].find(letter)                                 #Το t παίρνει την τιμή της θέσης του γράμματος,
        L += [t]                                                #αν βρεθεί το γράμμα στην θέση x στήν s[t:] τότε στήν s η θέση του θα ειναι η t+x,
        t += 1                                                  #μετά αυξάνεται κατά 1 για να βρεθεί η θέση στην υπόλοιπη λέξη, δηλ μετά την θέση t.
    return L                                                    
